# PerformanceAdviser Properties

---
The PerformanceAdviser type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace